//1
//1)შექმენი ფუნქცია, 
// რომელსაც გადაეცემა სახელი და default არგუმენტი სახელისთვის 
// ("Guest") ყოველ ჯერზე შექმენით უნიკალური guest-ის ნომერი 
// math.random()-ის გამოყენებით რომ guest-ს მიუწეროთ გვერდით 
// (მაგ: Guest158951) ამ ფუნქციამ უნდა დააბრუნოს მისალმება სახელისთვის 
// ან default მნიშვნელობისთვის (დაგჭირდებათ in ოპერატორი და ! ოპერატორი)
function randomsaxeli(name = "guest") {
    if  (!name || name === "guest"){ 
        const temo = Math.floor(Math.random() * 1000000)
        name = "guest" + temo;
    }
    return `hello ${name}` 
}



//2შექმენით ერთი ფუნქცია რომელსაც გადაეცემა ერთი სახელი არგუმენტად, და ასევე გადაეცით default პარამეტრად თქვენი სახელიც, ფუნქციამ უნდა დააბრუნოს მისალმება არგუმენტის გამოყენებით, გამოიყენეთ String Literal
//2) შექმენი მთავარი ფუნქცია generateEmail(firstName, lastName).მოთხოვნები:
//გამოიყენე helper function cleanText(text)
//helper ფუნქციამ ტექსტი უნდა გადააქციოს პატარა ასოებად
//საბოლოოდ დაბრუნდეს ელფოსტა ფორმატში: first.last@company.com
//გამოიძახეთ ფუნქციები hoisting საშუალებით
//3) შექმენით ფუნქცია, რომელიც დააგენერირებს რიცხვებს 1 დან 20 მდე, თქვენი დავალებაა რომ string literal ით დაპრინტოთ სტრინგი: "ჩემი რიცხვია {number}" გამოიძახეთ ფუნქცია hoisting საშუალებით



//შექმენი მთავარი ფუნქცია generateEmail(firstName, lastName).
//მოთხოვნები:
//გამოიყენე helper function cleanText(tex
//helper ფუნქციამ ტექსტი უნდა გადააქციოს პატარა ასოებად
//საბოლოოდ დაბრუნდეს ელფოსტა ფორმატში: first.last@company.com
//გამოიძახეთ ფუნქციები hoisting საშუალებით






//3) შექმენით ფუნქცია, რომელიც დააგენერირებს რიცხვებს 
// 1 დან 20 მდე, თქვენი დავალებაა რომ string literal ით
//  დაპრინტოთ სტრინგი: "ჩემი რიცხვია {number}" გამოიძახეთ ფუნქცია
//  hoisting საშუალებით
