#1) List-ის შექმნა და ელემენტების გამოტანა შექმენით სია, რომელიც შეიცავს 5 რიცხვს. შემდეგ გამოიტანეთ პირველი, ბოლო და შუათანაში მყოფი ელემენტები.

#2) List-ის შეცვლა შეასწორეთ შეცდომები რასაც ხედავთ არასწორს ჩაასწორედ აუციელბლად  num = [1, 3, 3, 4, 5, 6, 6, 8, 9, 12]


#2
num = [1, 3, 3, 4, 5, 6, 6, 8, 9, 12]
#      0   1  2  3  4  5  6  7  8  9
num[1]=2
num[5]=5
num[9]=10
print(num)
#1
num1=[1,2,3,4,5]
#     0 1 2 3 4
print(num1[0])
print(num1[4])
print(num1[2])
#3
num2=["H","A","L","L","O","W","E","N" ]
#      0   1   2   3   4   5   6   7
print(num2[0] +num2[1] +num2[2]+ num2[2] +num2[4] )

print(num2[5]+ num2[4] + num2[7])
#4) შეაერთე სიტყვა რომ გამოვიდეს GOA IS THE BEST ACADEMY
goa=["GOA" , "MAGARIA", "NOVATORI","IS","THE", "VIRGIN", "CHAD" ,"BEST" ,"ACADEMY"]
#     0        1           2        3    4       5        6        7         8
print( goa[0] , goa[3] , goa[4  ] , goa[7] , goa[8])




