

//1
const users = ["დათო", "მარი", "ლაშა", "ელენე"];
//1. გამოიყენეთ მეთოდი რომელიც დაითვლის თუ რამდენი ელემენტია მასივში
console.log(users.length);
//2. გამოიყენეთ მეთოდი რომელიც ამოიღებს მასივის ბოლო ელემენტს
users.pop();
//3. რიგის ბოლოში დაამატე კიდევ ერთი სახელი
users.push("თემო");
console.log(users);


//2
const shopList = ["პური", "რძე", "კვერცხი"];
//1 შეამოწმეთ არის თუ არა ამ მასივში სიტყვა რძე
console.log(shopList.includes("რძე"));


// 3
let queue = ["დათო", "ელენე"];
//1. დაამატე ლისთის ბოლოში ნიკა
queue.push("ნიკა");
//2. წაშალე პირველი ელემენტი დათო სიიდან
queue.shift();
//3. დაბეჭდე ახალი ლისთის სიგრძე და მთლიანი ლისთი
console.log(queue.length);
console.log(queue);






