/* translateX() - ელემენტს გადაადგილებს ჰორიზონტალურად (მარცხნივ/მარჯვნივ) */

/* translateY() - ელემენტს გადაადგილებს ვერტიკალურად (ზევით/ქვევით) */

/* translate() - ერთდროულად გადაადგილებს X და Y ღერძებზე */

/* scale() - ელემენტის ზომას ზრდის ან ამცირებს */

/* scaleX() - ცვლის მხოლოდ სიგანეს */

/* scaleY() - ცვლის მხოლოდ სიმაღლეს */

/* rotate() - ატრიალებს ელემენტს მითითებული გრადუსით */

/* skewX() - ელემენტს გადახრის X ღერძზე */

/* skewY() - ელემენტს გადახრის Y ღერძზე */

/* skew() - ელემენტს გადახრის ორივე ღერძზე */
//2,3,4