// // 1
// შექმენი ცარიელი მასივი და დაამატე მასში 3 რიცხვი push-ის გამოყენებით, შემდეგ დაბეჭდე მასივის length
    let temo = ["temo, gio vano"]
    temo.push("67,69,41")
    console.log(temo)

// 2
// შექმენი მასივი ["apple", "banana"] და დაამატე კიდევ ერთი ელემენტი "orange", შემდეგ დაბეჭდე ბოლო ელემენტი at-ის გამოყენებით
    let xili = ["apple","banana"]
    xili.push["orange"]
    console.log(xili.at(-1));
// 3
// შექმენი მასივი [1, 2, 3, 4] და წაშალე ბოლო ელემენტი pop-ის გამოყენებით, შემდეგ დაბეჭდე მასივის length
    let xxo = [67,68,69]
    xxo.pop()
    console.log(xxo.length)
// 4
// შექმენი ცარიელი მასივი, შემდეგ push-ით დაამატე 5 სხვადასხვა რიცხვი და შემდეგ 2-ჯერ გამოიყენე pop, ბოლოს დაბეჭდე პირველი ელემენტი
    let ronaldo = []
    ronaldo.push(5)
    ronaldo.push()
    console.log(ronaldo)
// 5
// შექმენი მასივი ["red", "blue"] და ჯერ დაამატე "green", შემდეგ წაშალე ბოლო ელემენტი და დაბეჭდე მასივის სიგრძე
    let a = ["red", "blue"] 
    console.push("green")
    console.log(a)
    console.log(a.length)
// 6
// შექმენი ცარიელი მასივი და დაამატე მასში შენი 3 საყვარელი საჭმელი, შემდეგ დაბეჭდე მეორე ელემენტი 
    let b = []
    b.push(1,2,3)
    console.log(b.length)
// 7
// შექმენი მასივი [10, 20] და დაამატე კიდევ 2 რიცხვი, შემდეგ ერთი ამოიღე და დაბეჭდე ბოლო ელემენტი at()-ით
    let g = [10, 20]
    g.push(44,45)
    console.log(g.at(-1))
// 8
// შექმენი მასივი ["a", "b", "c"] და pop-ის გამოყენებით წაშალე ორი ელემენტი, შემდეგ დაბეჭდე დარჩენილი ელემენტის სიგრძე
    let c = ["a", "b", "c"]
    c.pop()
    console.log(c.length)
// 9
// შექმენი ცარიელი მასივი, დაამატე 4 ელემენტი და შემდეგ ყველა ელემენტი ამოიღე pop-ის გამოყენებით
    let d = [1, 2, 3,4]
    d.pop()
    console.log(d)
// 10
// შექმენი მასივი [5] და push-ის გამოყენებით დაამატე კიდევ 3 რიცხვი, შემდეგ დაბეჭდე მესამე ელემენტი at()-ით_____
let f =[5]
f.push(12,14,16)
console.log(f.at(-1));
