//1)

javascript
const person = {
  name: "Temo",
  age: 18,

  getName: function () {
    return this.name;
  }
};

console.log(person.getName()); 


//აქ `this.name` აბრუნებს იმავე ობიექტის `name`-ის მნიშვნელობას.

//2)

//Arrow ფუნქციაში `this`-ს ვერ ვიყენებთ ისე, როგორც ჩვეულებრივ ფუნქციაში, რადგან arrow ფუნქციას საკუთარი `this` არ აქვს. ის `this`-ს იღებს იმ გარემოდან (scope-დან), სადაც შეიქმნა, ამიტომ ობიექტის მეთოდად გამოყენებისას `this` არ მიუთითებს თავად ობიექტზე.

//3)

//დავასრულე საკლასო დავალება, გადავხედე ობიექტებზე გაკვეთილის ჩანაწერს და შევასრულე Codecademy-ის დავალებები.
