//.slice() - ამით ჩვენ შეგვიძლია სლაისინგი მოვახდინოთ სიაზე, ანუ ამოვჭრათ სიის კონკრეტული ელემენტები. გადაეცემა start და end მნიშვნელობა
//.splice() - ამით ჩვენ შეგვიძლია კონკრეტული ელემენტები წავშალოთ სიიდან. გადაეცემა start და count მნიშვნელობა.
//start ში გადავცემთ რომელი ინდექსიდან გვინდა რომ დაიწყოს, ხოლო count ში რამდენი ელემენტი გვინდა რომ ამოჭრას
//.shift() - გამოიყენება სიიდან პირველი ელემენტის წასაშლელად. 
//.unshift() - გამოიყენება სიის დასაწყისში ელემენტის ან რამდენიმე ელემენტის ჩასამატებლად
//.concat() - გამოიყენება რამდენიმე სიის გაერთიანებისთვის
//.join() - გამოიყენება სიის გაერთიანებისთვის. ზუსტად იგივე დანიშნულება აქ რაც პითონში უბრალოდ სხვანაირად იწერება, ჯერ ვწერთ სიის სახელს, და შემდეგ ფრჩხილებში სიმბოლოს რاც გვინდა რომ ელემენტების შუაში იყვეს
//.indexOf() - გამოიყεნεბa  

1//
let temo = [20,35,61,1488,228,52,42,45]
let temo2 = temo.slice(2,5)
console.log(temo2)
//2
let temo3 = temo.splice(1,4)
console.log(temo3)


//3

let temooo = [20,35,61,1488,]
temooo.shift()
console.log(temooo)
//4
temooo.unshift(20)
//5
let t = [1,2,3,4]
let t2 = t3.concat(t).join("%")
console.log(t2)
//6
let t3 = [5,6,7,8]
let t4 = t.indexOf(3)
console.log(t4)
//7
let vv = [5,7,7,8,9]
let ccv = t.concat(vv)